tap "emqx/mqttx"
tap "homebrew/bundle"
tap "homebrew/services"
brew "act"
brew "btop"
brew "curl"
brew "emqx"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fnm"
brew "git"
brew "httpie"
brew "jmeter"
brew "nano"
brew "onefetch"
brew "python@3.12"
brew "rustup"
brew "smartmontools"
brew "stow"
brew "tree"
brew "wget"
brew "emqx/mqttx/mqttx-cli"
cask "applite"
cask "balenaetcher"
cask "c0re100-qbittorrent"
cask "chatwise"
cask "easydict"
cask "git-credential-manager"
cask "loop"
cask "mqttx"
cask "qlmarkdown"
cask "spotify"
cask "syntax-highlight"
cask "visual-studio-code"
vscode "ahmadalli.vscode-nginx-conf"
vscode "antfu.file-nesting"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "clashmeta.meta-json-schema"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "jakebathman.mysql-syntax"
vscode "kevinkyang.auto-comment-blocks"
vscode "liamhammett.inline-parameters"
vscode "lokalise.i18n-ally"
vscode "luisllamas.vscodesnap"
vscode "meganrogge.template-string-converter"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "njpwerner.autodocstring"
vscode "pgourlain.erlang"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "raynigon.nginx-formatter"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sabieber.hocon"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tlahmann.alex-linter"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudioexptteam.vscodeintellicode-insiders"
vscode "vitest.explorer"
vscode "vue.volar"
vscode "william-voyek.vscode-nginx"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zzzz.hocon-colorizer"
